In [4]:
https://github.com/Devinterview-io/pandas-interview-questions

SyntaxError: invalid syntax (2490814022.py, line 1)

In [34]:
import pandas as pd
import numpy as np


# Create a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'], 
    'Age': [25, 30, 35, 40],
    'Department': ['HR', 'Finance', 'IT', 'Marketing']
}
df = pd.DataFrame(data)
df

      Name  Age Department
0    Alice   25         HR
1      Bob   30    Finance
2  Charlie   35         IT
3    Diana   40  Marketing

In [6]:
#df.describe()

In [7]:
# Filter and sort the data 
df[df['Department'].isin(['HR', 'IT'])]

      Name  Age Department
0    Alice   25         HR
2  Charlie   35         IT

In [8]:
df.sort_values(by='Age', ascending = False)

      Name  Age Department
3    Diana   40  Marketing
2  Charlie   35         IT
1      Bob   30    Finance
0    Alice   25         HR

In [9]:
# Handle missing data

In [10]:
df.at[2, 'Age'] = None        # Simulate missing age for 'Charlie'
df

      Name   Age Department
0    Alice  25.0         HR
1      Bob  30.0    Finance
2  Charlie   NaN         IT
3    Diana  40.0  Marketing

In [11]:
df.dropna(inplace=True)  # Drop rows with any missing data

In [12]:
df

    Name   Age Department
0  Alice  25.0         HR
1    Bob  30.0    Finance
3  Diana  40.0  Marketing

In [13]:
# Group, aggregate,

In [14]:
df.groupby('Department')['Age'].mean()

Department
Finance      30.0
HR           25.0
Marketing    40.0
Name: Age, dtype: float64

In [15]:
data = {'A': [1, 2, 3, 4, 5],
        'B': [10, 20, 30, 40, 50],
        'C': ['foo', 'bar', 'baz', 'qux', 'quux']}
df = pd.DataFrame(data)
df

   A   B     C
0  1  10   foo
1  2  20   bar
2  3  30   baz
3  4  40   qux
4  5  50  quux

In [16]:
# Slicing 
df.iloc[1:4, 0:2]

   A   B
1  2  20
2  3  30
3  4  40

In [17]:
# Filtering
df[df['A'] > 2]

   A   B     C
2  3  30   baz
3  4  40   qux
4  5  50  quux

In [18]:
data = {'names': ['Alice', 'Bob', 'Charlie'], 'scores': [80, 90, 85]}
df = pd.DataFrame(data)
df

     names  scores
0    Alice      80
1      Bob      90
2  Charlie      85

In [19]:
# Doubling the scores using .apply() and a lambda function

df['scores'].apply(lambda x: x*2)

0    160
1    180
2    170
Name: scores, dtype: int64

In [20]:
data = {'A': [1, 1, 2, 2, 3, 3], 'B': ['a', 'a', 'b', 'b', 'c', 'c']}
df = pd.DataFrame(data)
df

   A  B
0  1  a
1  1  a
2  2  b
3  2  b
4  3  c
5  3  c

In [21]:
df.drop_duplicates()

   A  B
0  1  a
2  2  b
4  3  c

In [22]:
# Alternatively, you can keep the last occurrence
df.drop_duplicates(keep='last')

   A  B
1  1  a
3  2  b
5  3  c

In [23]:
df.groupby('A').mean()

C:\Users\KISHOR\AppData\Local\Temp\ipykernel_10408\714605139.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').mean()

Empty DataFrame
Columns: []
Index: [1, 2, 3]

In [24]:
# Count duplicates
df.duplicated().sum()

3

In [25]:
data = {
    'Date': ['2020-01-01', '2020-01-01', '2020-01-02', '2020-01-02'],
    'Category': ['A', 'B', 'A', 'B'],
    'Value': [10, 20, 30, 40]
}

df = pd.DataFrame(data)
df

         Date Category  Value
0  2020-01-01        A     10
1  2020-01-01        B     20
2  2020-01-02        A     30
3  2020-01-02        B     40

In [26]:
df.pivot(index='Date', columns = 'Category', values = 'Value')

Category     A   B
Date
2020-01-01  10  20
2020-01-02  30  40

In [27]:
data = {'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

# Applying 'where'
df.where(df > 2, df * 10)

    A   B
0  10  10
1  20  20
2   3  30
3   4  40
4   5  50

In [28]:
import pandas as pd

df = pd.DataFrame({'column1': ['A', 'B', 'C', 'A', 'C',
							'C', 'B', 'D', 'D', 'A'],
				'column2': [5, 10, 15, 20, 25, 30, 
							35, 40, 45, 50]})
df

  column1  column2
0       A        5
1       B       10
2       C       15
3       A       20
4       C       25
5       C       30
6       B       35
7       D       40
8       D       45
9       A       50

In [29]:
df.groupby('column1')['column2'].apply(list)

column1
A     [5, 20, 50]
B        [10, 35]
C    [15, 25, 30]
D        [40, 45]
Name: column2, dtype: object

In [30]:
df.groupby('column1').agg(list)

              column2
column1
A         [5, 20, 50]
B            [10, 35]
C        [15, 25, 30]
D            [40, 45]

In [33]:
data = [1,3,4, 'kishor']
series = pd.Series(data)
series

0         1
1         3
2         4
3    kishor
dtype: object

In [43]:
data = np.array(['g','e','e', 'k', 's'])
pd.Series(data, index=[1,2,9,4,5])

1    g
2    e
9    e
4    k
5    s
dtype: object

In [45]:
dict = {'Geeks': 10,  'for': 20,  'geeks': 30}
pd.Series(dict)

Geeks    10
for      20
geeks    30
dtype: int64

In [49]:
pd.Series(np.random.randn(3))

0   -0.460821
1   -0.385982
2   -0.101215
dtype: float64

In [51]:
pd.Series(range(5))

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [53]:
ser = pd.Series(10, index=[1,2,9,4,5])
ser.copy(deep=False)   #shallow
ser.copy(deep=True)

1    10
2    10
9    10
4    10
5    10
dtype: int64

In [55]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [56]:
lst = ['Geeks', 'For', 'Geeks', 'is',
  'portal', 'for', 'Geeks']
pd.DataFrame(lst)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [57]:
lst = [[1, 'Geeks'], [2, 'For'], [3, 'Geeks']]
pd.DataFrame(lst, columns=['id','data'])

   id   data
0   1  Geeks
1   2    For
2   3  Geeks

In [68]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}
df =pd.DataFrame(data)
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [69]:
df.iloc[:1] # first row

  Name  Age
0  Tom   20

In [71]:
df.rename(columns={'Name': 'new_name', 'Age':'New_age'}, inplace=False)

  new_name  New_age
0      Tom       20
1     nick       21
2    krish       19
3     jack       18

In [67]:
df.reindex(df['Age'])

    Name  Age
Age
20   NaN  NaN
21   NaN  NaN
19   NaN  NaN
18   NaN  NaN

In [59]:
lst = [{1: 'Geeks', 2: 'For', 3: 'Geeks'},
  {1: 'Portal', 2: 'for', 3: 'Geeks'}]
pd.DataFrame(lst)

        1    2      3
0   Geeks  For  Geeks
1  Portal  for  Geeks

In [72]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}
df =pd.DataFrame(data)
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [73]:
# add row
df.loc[4] = ['kishor', 29]

In [74]:
df

     Name  Age
0     Tom   20
1    nick   21
2   krish   19
3    jack   18
4  kishor   29

In [79]:
# add column
df['mark'] = [122,144,132,132,149]
df

     Name  Age  mark
0     Tom   20   122
1    nick   21   144
2   krish   19   132
3    jack   18   132
4  kishor   29   149